jsebgiraldo/stm32l496_ov5640/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fatfs.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdio.h"
#include "string.h"

#include "user_ring_buffer.h"

#include "ff_gen_drv.h"
#include "sd_diskio.h"

#include "ov5640.h"

#include "stm32l496g_discovery.h"
#include "stm32l496g_discovery_io.h"
#include "stm32l496g_discovery_camera.h"
#include "stm32l496g_discovery_lcd.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum
{
  E_RED  ,
  E_GRN  ,
  E_YEL  ,
  E_BLU  ,
  E_MAG  ,
  E_CYN  ,
  E_WHT  ,
  E_RESET,
  E_LAST,
}printf_color_t;

const char *str_color[E_LAST] =
{
    "\x1B[31m",
    "\x1B[32m",
    "\x1B[33m",
    "\x1B[34m",
    "\x1B[35m",
    "\x1B[36m",
    "\x1B[37m",
    "\x1B[0m"
};


/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
static const char *TAG = " [MAIN] ";
#define printf_dbg(format, ...)     	\
    do                                 	\
    {                                 	\
        printf(str_color[E_MAG]);		\
        printf(TAG);					\
        printf(str_color[E_RESET]);   	\
        printf(format, ##__VA_ARGS__); 	\
    } while (0)

#define PROJECT_NAME "STM32L496"
#define VERSION "1.0"

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
 DCMI_HandleTypeDef hdcmi;
DMA_HandleTypeDef hdma_dcmi;

DMA2D_HandleTypeDef hdma2d;

SD_HandleTypeDef hsd1;

UART_HandleTypeDef huart2;

SRAM_HandleTypeDef hsram1;
SRAM_HandleTypeDef hsram2;

/* USER CODE BEGIN PV */

OV5640_Object_t   OV5640Obj;

HAL_StatusTypeDef hal_status = HAL_OK;

#define XQUEUE_BUFFER_SIZE 20
ring_buffer_handle_t xQueue_IRQ_Events;
static uint16_t xQueue_IRQ_buffer[XQUEUE_BUFFER_SIZE];


#define   jpeg_buf_size     31*1024
uint32_t  jpeg_data_buf[jpeg_buf_size];

uint8_t jpeg_data_encode[jpeg_buf_size];

uint16_t pBuffer[240 * 240];


FATFS SDFatFs;  /* File system object for SD card logical drive */
FIL MyFile;     /* File object */
//char SDPath[4]; /* SD card logical drive path */

typedef enum {
  APPLICATION_IDLE = 0,
  APPLICATION_RUNNING,
  APPLICATION_SD_UNPLUGGED,
}FS_FileOperationsTypeDef;

FS_FileOperationsTypeDef Appli_state = APPLICATION_IDLE;

static uint8_t isInitialized = 0;
static uint8_t isCreated = 0;
uint8_t workBuffer[_MAX_SS];

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_NVIC_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void Error_Handler(void);

int _write(int file, char *ptr, int len) {
	//CDC_Transmit_FS((uint8_t*) ptr, len);
	return HAL_UART_Transmit(&huart2, (uint8_t *)ptr, len,100);
}

static void print_startup_msg(void)
{
  printf("******************************************\r\n");
  printf("*	Project :\t %s       *\r\n", PROJECT_NAME);
  printf("*	Version :\t %s             *\r\n", VERSION);
  printf("*	Date    :\t %s     *\r\n", __DATE__);
  printf("******************************************\r\n");
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	static uint32_t currentMillis = 0;
	static uint32_t previusMillis = 0;

	currentMillis = HAL_GetTick();
	if(currentMillis - previusMillis > 250)
	{
		ring_buffer_put(xQueue_IRQ_Events, GPIO_Pin);
		previusMillis = currentMillis;
	}

}

/**
  * @brief LCD image preparation.
  * @note  Configure image position and size for Discovery STM32L496 LCD
  *        and set LCD in pixel writing mode.
  *        This API must be followed by LCD_Write() call.
  * @param  x0: first pixel x position
  * @param  y0: first pixel y position
  * @param  xSize: image width (in pixels)
  * @param  ySize: image height (in pixels)
  * @retval None
  */


void jpeg_dcmi_frame_callback(DMA_HandleTypeDef *_hdma)
{
        uint8_t *p;
        uint32_t i=0,jpgstart=0,jpglen=0;
        uint8_t  head=0;



        HAL_DCMI_Stop(&hdcmi);

        p=(uint8_t*)jpeg_data_buf;


        FRESULT res; /* FatFs function common result code */
          uint32_t byteswritten; /* File write/read counts */


          /* Register the file system object to the FatFs module */
          if(f_mount(&SDFatFs, (TCHAR const*)SDPath, 0) == FR_OK)
          {
        	printf_dbg("f_mount!\r\n");
        #if 1
            if (isCreated == 0)
            {
              res = f_mkfs(SDPath, FM_ANY, 0, workBuffer, sizeof(workBuffer));

              if (res != FR_OK)
              {
                Error_Handler();
                while(1);
              }
            }
            isCreated = 1;
        #endif
            /* Create and Open a new text file object with write access */
            if(f_open(&MyFile, "STM32.jpeg", FA_CREATE_ALWAYS | FA_WRITE) == FR_OK)
            {
              printf_dbg("f_open!\r\n");
              /* Write data to the text file */

              for(i=0;i<jpeg_buf_size * 4; i++) //search for 0XFF 0XD8 and 0XFF 0XD9, get size of JPG
			  {
					  if((p[i]==0XFF)&&(p[i+1]==0XD8))
					  {
							  jpgstart=i;
							  head=1;	// Already found  FF D8
					  }
					  if((p[i]==0XFF)&&(p[i+1]==0XD9)&&head)  //search for FF D9
					  {
							  jpglen=i-jpgstart+2;
							  break;
					  }
			  }
			  if(jpglen)
			  {
					  p+=jpgstart;	// move to FF D8
					  //HAL_UART_Transmit(&huart2, p, jpglen, 5000);
					  res = f_write(&MyFile, p, jpglen, (void *)&byteswritten);

					  // printf("jpg_size :  %d \r\n" , jpglen);
					  //printf("jpgstart :  %d \r\n" , jpgstart);
			  }

              res = f_write(&MyFile, jpeg_data_buf, jpeg_buf_size, (void *)&byteswritten);



              printf_dbg("f_write!\r\n");

              if((byteswritten > 0) && (res == FR_OK))
              {
                /* Close the open text file */
                f_close(&MyFile);
                printf_dbg("f_close!\r\n");
              }
            }
          }





        HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_CONTINUOUS, (uint32_t)jpeg_data_buf, jpeg_buf_size/4);
}

/**
  * @brief LCD image write-up.
  * @note  Resort to DMA to feed image pixels to STM32L496 Discovery LCD.
  *        LCD is configured in RGB565: one pixel is coded over 16 bits.
  * @param  OrigAddress: Image address
  * @param  DestAddress: LCD RAM address
  * @param  TransferSize: image size (in pixels)
  * @retval HAL status
  */


/**
  * @brief  Initialize the SD card.
  * @param  None
  * @retval None
  */
static void SD_Initialize(void)
{
  if (isInitialized == 0)
  {
    if (BSP_SD_Init() == MSD_OK)
    {
      BSP_SD_ITConfig();
      isInitialized = 1;
      printf_dbg("SD Initialize Okey!\r\n");
    }
    else
    {
      BSP_LED_On(LED1);
      printf_dbg("SD Initialize ERROR!!\r\n");
      /* wait until the uSD is plugged */
      while (BSP_SD_IsDetected() != SD_PRESENT)
      {}
      BSP_LED_Off(LED1);
    }
  }
}

/**
  * @brief  Frame Event callback.
  * @param  None
  * @retval None
  */


static void FS_FileOperations(void)
{
  FRESULT res; /* FatFs function common result code */
  uint32_t byteswritten; /* File write/read counts */


  /* Register the file system object to the FatFs module */
  if(f_mount(&SDFatFs, (TCHAR const*)SDPath, 0) == FR_OK)
  {
	printf_dbg("f_mount!\r\n");
#if 1
    if (isCreated == 0)
    {
      res = f_mkfs(SDPath, FM_ANY, 0, workBuffer, sizeof(workBuffer));

      if (res != FR_OK)
      {
        Error_Handler();
        while(1);
      }
    }
    isCreated = 1;
#endif
    /* Create and Open a new text file object with write access */
    if(f_open(&MyFile, "STM32.jpeg", FA_CREATE_ALWAYS | FA_WRITE) == FR_OK)
    {
      printf_dbg("f_open!\r\n");
      /* Write data to the text file */
      res = f_write(&MyFile, jpeg_data_buf, jpeg_buf_size, (void *)&byteswritten);
      printf_dbg("f_write!\r\n");
      if((byteswritten > 0) && (res == FR_OK))
      {
        /* Close the open text file */
        f_close(&MyFile);
        printf_dbg("f_close!\r\n");
        return;
      }
    }
  }
  /* Error */
  Error_Handler();
}

void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi)
{
	printf_dbg("HAL_DCMI_FrameEventCallback\r\n");

	//FS_FileOperations();

	jpeg_dcmi_frame_callback(&hdma_dcmi);
	HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);   // OFF
	__HAL_DCMI_DISABLE_IT(hdcmi, DCMI_IT_FRAME|DCMI_IT_OVR|DCMI_IT_ERR|DCMI_IT_VSYNC|DCMI_IT_LINE);

